// Задача 1⋕js.Pm.Osr.Sp.1

// Дан массив:

// let arr = [1, 2, 3, 4, 5];
// // Дана также функция:

// function func(num1, num2, num3, num4, num5) {
// 	return num1 + num2 + num3 + num4 + num5;
// }
// // Найдите с помощью приведенной функции сумму элементов массива.

// console.log(func(...arr))
//----------------------------------------------------------------------------------------------
// Задача 3⋕js.Pm.Osr.Sp.3

// Дан массив с числами. Используя Math.min и spread выведите на экран минимальное значение массива.

// let arr = [1, 2, 3, 4, 5];
// console.log(Math.min(...arr))