// Задача 1⋕js.Pm.Enm.Fi.1
// Дан массив с числами. Оставьте в нем только положительные числа.

// let arr = [-1, -2, 0, 1, 4];

// console.log(arr.filter(elem => elem > 0));
// ---------------------------------------------------------------------------------------------------------------

// Задача 2⋕js.Pm.Enm.Fi.2
// Дан массив с числами. Оставьте в нем только отрицательные числа.

// let arr = [-1, -2, 0, 1, 4];

// console.log(arr.filter(elem => elem < 0));
// ---------------------------------------------------------------------------------------------------------------

// Задача 3⋕js.Pm.Enm.Fi.3
// Дан массив с числами. Оставьте в нем только числа, которые больше нуля, но меньше 10.

// let arr = [-1, -2, 0, 1, 4, 6, 12];

// console.log(arr.filter(elem => elem > 0 &&  elem < 10));

// ---------------------------------------------------------------------------------------------------------------

// Задача 4⋕js.Pm.Enm.Fi.4

// Дан массив со строками. Оставьте в нем только те строки, длина которых больше 5-ти символов.

// let arr = ['bread' , 'salt', 'shugar', 'apple', 'water', 'mel', 'rum'];

// console.log(arr.filter(elem => elem.length > 5));

// ---------------------------------------------------------------------------------------------------------------
// Задача 5⋕js.Pm.Enm.Fi.5

// Дан массив с числами. Оставьте в нем только те числа, произведение которых на их порядковый номер меньше 30.

// let newArr = [];
// for(let i = 0; i<35; i++) {
//   newArr.push(i)
// }

// console.log(newArr.filter((elem, index) => index <30));

// ---------------------------------------------------------------------------------------------------------------

// Задача 6⋕js.Pm.Enm.Fi.6
// Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только обычные элементы.

// let arr = [1, 2, [3, 4], 5, [6, 7]];

// console.log(arr.filter(elem => typeof elem === 'string'));

// ---------------------------------------------------------------------------------------------------------------

// Задача 7⋕js.Pm.Enm.Fi.7

// Дан массив с числами. Посчитайте количество отрицательных чисел в этом массиве.


// let arr = [-1, -2, 0, 1, 4, 6, 12];

// console.log(arr.filter(elem => elem < 0).length);
