
// Задача 1⋕js.Pm.Enm.Sm.1

// Дан массив с числами. Проверьте то, что в массиве есть хотя бы одно число больше нуля.

// let arr = [-2, -4, -6, 8];
// console.log(arr.some(elem => elem>0));

//------------------------------------------------------------------------------------

// Задача 2⋕js.Pm.Enm.Sm.2

// Дан массив с числами. Проверьте то, что хотя бы для одного элемента произведение его значения на порядковый номер больше 30.

// let arr = [-2, -4, -6, 8, 20];
// console.log(arr.some(elem => elem*elem >30));