// Задача 1⋕js.Pm.Enm.Ev.1

// Дан массив с числами. Проверьте то, что все элементы в массиве больше нуля.

// let arr = [-2, 2, 4, 6, 8];
// console.log(arr.every(elem => elem >0));

// let arr2 = [ 2, 4, 6, 8];
// console.log(arr2.every(elem => elem >0));

//------------------------------------------------------------------------------------

// Задача 2⋕js.Pm.Enm.Ev.2
// Дан массив с числами. Проверьте то, что для всех элементов произведение их значений на их порядковый номер меньше 30.

// let arr = [-2, 2, 4, 6, 8];
// console.log(arr.every(elem => elem * elem < 30));